package org.example.basics.constructions;
/**
 * <p>Класс <b>PositiveNumberCheckerIfElseOperator</b> демонстрирует использование оператора IF-ELSE
 * в Java для проверки числа на знак относительно нуля. Этот класс иллюстрирует, как можно использовать
 * условные операторы для ветвления логики в программе.</p>
 *
 * <p>Особенностью оператора IF-ELSE, в отличие от тернарного оператора, является его способность
 * выполнять блоки кода без возврата значения. Это делает IF-ELSE идеальным выбором для ситуаций,
 * где требуется выполнение различных действий в зависимости от условий.</p>
 *
 * <p>Пример в классе считывает число с консоли и выводит сообщение о том, является ли число
 * положительным, отрицательным или равным нулю.</p>
 */
public class PositiveNumberCheckerIfElseOperator {
}
