package org.example.oop.interfacefeatures;
/**
 * Интерфейс Shape демонстрирует различные возможности интерфейсов в Java.
 * <p>
 * Используется в образовательных целях для иллюстрации следующих особенностей интерфейсов:
 * <ul>
 *     <li><b>Константные поля</b> - Поля, которые являются по умолчанию public, static и final.</li>
 *     <li><b>Статические методы</b> - Методы, связанные с интерфейсом, а не с объектами его реализующими (добавлено в Java 8).</li>
 *     <li><b>Абстрактные методы</b> - Методы, которые должны быть реализованы в классах, реализующих интерфейс.</li>
 *     <li><b>Методы по умолчанию</b> - Методы с реализацией по умолчанию в интерфейсе (добавлено в Java 8).</li>
 * </ul>
 * <p>
 * Этот интерфейс включает методы для расчета площади и периметра фигуры, а также для отображения информации о фигуре.
 */
interface Shape {
}