package org.example.collections;
/**
 * Класс <b>GenericBasics</b> демонстрирует базовые принципы использования дженериков в Java.
 * В примере представлен класс Box, реализующий концепцию универсальной коробки (container), способной хранить объекты любого типа.
 *
 * <p>В методе main создаются и используются экземпляры Box для различных типов данных, включая Integer, String и пользовательский тип User.
 * Это демонстрирует, как класс Box может быть универсально применен для хранения разнообразных типов данных.</p>
 *
 * <p>Класс Box определяет обобщенный тип <T>, который позволяет использовать его для хранения любого объекта.
 * Методы put и get используются для помещения и получения содержимого Box соответственно. Метод toString переопределен
 * для представления содержимого коробки в удобочитаемом формате.</p>
 *
 * <p>Данный пример является полезным ресурсом для понимания основ работы с дженериками в Java и создания гибких, типобезопасных классов.</p>
 */
public class GenericBasics {
}
