package org.example.collections;
/**
 * Класс <b>LibraryManagementSystem</b> реализует систему управления библиотекой. Он использует Map для организации хранения и управления книгами.
 * В Map ключом является ISBN книги, а значением - объект книги. Класс предлагает функциональность для добавления, обновления, проверки наличия и удаления книг.
 * Также предусмотрен метод для отображения списка всех книг в библиотеке.
 *
 * <p>Примеры использования класса включают добавление новых книг, обновление информации о существующих книгах,
 * проверку наличия книги по её ISBN и удаление книг из системы. Метод printBooks позволяет выводить информацию о всех книгах в библиотеке.</p>
 *
 * <p>Этот класс демонстрирует практическое применение коллекций в Java, особенно использование Map для создания
 * структурированных и эффективных систем управления данными в приложениях.</p>
 */
public class LibraryManagementSystem {
}
