package org.example.other;
/**
 * Класс RegexExample демонстрирует использование регулярных выражений в Java для поиска и извлечения данных.
 * <p>
 * Этот класс является образовательным примером, показывающим:
 * <ul>
 *     <li>Создание и применение регулярных выражений для текстового анализа.</li>
 *     <li>Использование классов Pattern и Matcher для выполнения поиска по шаблону.</li>
 *     <li>Извлечение и вывод соответствующих фрагментов текста, соответствующих шаблону.</li>
 * </ul>
 * <p>
 * В данном примере регулярное выражение используется для поиска адресов электронной почты в тексте.
 * Обнаруженные адреса собираются в список и выводятся.
 */
public class RegexExample {
}
