package org.example.oop.inheritance;
/**
 * Класс Person демонстрирует основы создания классов в Java.
 * <p>
 * Используется в учебных целях для иллюстрации концепции классов и базовых характеристик объектов.
 * <p>
 * Основные характеристики:
 * <ul>
 *     <li><b>name</b> - Имя человека.</li>
 *     <li><b>age</b> - Возраст человека.</li>
 * </ul>
 * <p>
 * Конструктор класса инициализирует эти атрибуты.
 * <p>
 * Метод <b>displayInfo</b> используется для вывода информации о человеке.
 */
class Person {
}