package org.example.basics.variables;
/**
 * <p>Класс <b>StaticAndNonStaticVariables</b> демонстрирует использование статических и нестатических
 * переменных в Java. В классе показаны способы доступа к этим переменным и приведен пример изменения
 * одной глобальной переменной на уровне класса при использовании инкремента в конструкторе.</p>
 *
 * <p>Статическая переменная (static) totalCount представляет собой глобальный счетчик, общий для всех
 * экземпляров класса Counter. Каждое создание экземпляра Counter увеличивает это значение.
 * В отличие от нестатической переменной instanceCount, которая уникальна для каждого объекта и отслеживает
 * счет только для данного экземпляра.</p>
 *
 * <p>Примеры создания экземпляров класса Counter и вызова метода displayCounts иллюстрируют разницу
 * в поведении и использовании статических и нестатических переменных. Это помогает понять концепцию области
 * видимости переменных и как они управляются и хранятся в памяти.</p>
 *
 * <p>Класс является полезным ресурсом для изучения основ работы со статическими и нестатическими переменными
 * в объектно-ориентированном программировании на Java.</p>
 */
public class StaticAndNonStaticVariables {
}
