package org.example.oop;
/**
 * Класс демонстрирует использование перечислений (Enums) в Java.
 * <p>
 * В этом примере создается перечисление Day, которое включает в себя дни недели.
 * Каждое значение перечисления имеет связанный с ним тип дня (рабочий или выходной).
 * </p>
 * <p>
 * В классе также присутствует метод для демонстрации работы с перечислениями,
 * включая итерацию по значениям и доступ к связанным полям.
 * </p>
 *
 * @author Имя Автора
 * @version 1.0
 */
public class EnumDemo {
}
