package org.example.basics.operations;
/**
 * <p>Класс <b>SimpleRoundingExample</b> демонстрирует метод простого округления чисел с плавающей точкой,
 * используя кастование к типу int. Этот метод не требует применения математических функций класса Math
 * и является базовым примером округления в Java.</p>
 *
 * <p>В классе показано, как округлить число до ближайшего целого, добавляя 0.5 к исходному числу и преобразуя
 * результат к целочисленному типу. Этот подход также применяется для отрицательных чисел с использованием вычитания 0.5.</p>
 *
 * <p>Дополнительно представлен пример округления до определенного количества десятичных знаков, который включает
 * умножение числа на степень десятки, последующее округление и деление на ту же степень десятки.</p>
 *
 * <p>Этот класс полезен для понимания основных принципов округления без использования специализированных математических методов.</p>
 */
public class SimpleRoundingExample {
}
